using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace Designer.Presentation
{
    public partial class Help : Form
    {
        public Help()
        {
            InitializeComponent();
            label1.Text = "Справка\n1. Управление камерой (управление осуществляется в 3d режиме):\n  - Для поворота камеры зажмите левую кнопку мыши и двигайте мышью;\n  - Для перемещения камеры зажмите правую кнопку мыши и двигайте\n    мышью.\n2. Выбор планировки: в этом режиме необходимо выбрать тип планировки\n    и указать размерыкомнаты.\n3. Выбор поктрытия: в этом режиме необходимо выбрать покрытие для\n    стен и пола.\n4. Добавление мебели: в это режиме для добавления мебели необходимо\n    выбрать мебель из списка и левой кнопкой мыши кликнуть по месту\n    куда её необходимо добавить.\n5. Для сохранения комнаты необходимо нажать на влкадку 'Файл', затем\n    на вкладку 'Сохранить' и указать название комнаты с последующим\n    нажатием кнопки 'Сохранить'.\n6. Для загрузки необходимонажать на влкадку 'Файл', затем\n    на вкладку 'Загрузить' и выбрать название комнаты с последущим\n    нажатием кнопки 'Загрузить'.";
        }

        private void button1_Click(object sender, EventArgs e)
        {
            DialogResult = DialogResult.OK;
        }
    }
}
